Tekla.Structures.Model.ISharedModelState
Represents the shared model state in Tekla Structures.

Tekla.Structures.Model.ISharedModelState.State
Gets the state of the service.

Tekla.Structures.Model.ISharedModelState.SetBy
Gets display name of the user who has set the state.

Tekla.Structures.Model.ISharedModelState.LockOwner
Gets display name of the user who owns a lock (in case it is set).

Tekla.Structures.Model.ISharedModelState.IsLockOwner
Gets a value indicating whether the current user is the lock owner.

Tekla.Structures.Model.ISharedModelState.Comment
Gets comment provided at setting state.

Tekla.Structures.Model.ISharedModelState.PendingVersionsCount
Gets number of pending versions or null when it is not relevant (for example model is not shared) or failed to get it.